using System;

namespace asd_kursach
{
    public class Global_Data_Things
    {
        // Создаем массив объектов для хранения данных о предметах
        public static (string name, int weight, int value)[] items = {
            ("Банка огурцов", 3, 500),
            ("Ноутбук", 2, 30000),
            ("Пневматический пистолет", 1, 7000),
            ("Бензопила", 3, 5000),
            ("Раскладной стул", 1, 1000),
            ("Пуховик", 2, 15000),
            ("1 том 'Война и Мир'", 20, 2000),
            ("Набор виниловых пластинок", 2, 18000),
            ("Гаечный ключ", 1, 700),
            ("Гиря 24", 24, 5000),
            ("Курсовая работа по АСД", 30, 10000),
            ("Проектор", 7, 12000),
            ("Банка помидоров", 3, 400),
            ("Насос автомобильный", 5, 9000),
            ("2 кирпича", 8, 40),
            ("Рюкзак", 1, 3000),
            ("Фонарик", 1, 1500),
            ("Велосипед", 15, 15000),
            ("Книга '1984'", 1, 500),
            ("Портативная колонка", 1, 7000),
            ("Сумка для ноутбука", 1, 2500),
            ("Кофеварка", 3, 5000),
            ("Термос", 1, 1200),
            ("Кресло", 5, 6000),
            ("Микроволновка", 10, 8000),
            ("Сковорода", 2, 4000),
            ("Тостер", 3, 2500),
            ("Шлем для велоспорта", 1, 1500),
            ("Лопата", 2, 800),
            ("Картонная коробка", 1, 100),
            ("Стул-качалка", 10, 5000),
            ("Сумка для путешествий", 3, 3500),
            ("Портативный аккумулятор", 1, 3000),
            ("Картридж для принтера", 1, 2000),
            ("Кофейная чашка", 1, 300),
            ("Пара кроссовок", 1, 4000),
            ("Набор для рисования", 2, 1500),
            ("Плита", 50, 15000),
            ("Картонный экран", 2, 700),
            ("Электрическая зубная щетка", 1, 2500),
            ("Набор инструментов", 5, 4000),
            ("Садовый шланг", 6, 2000),
            ("Скейтборд", 3, 6000),
            ("Картонная модель самолета", 1, 150),
            ("Пачка бумаги", 2, 500),
            ("Пара лыж", 15, 12000),
            ("Кукла", 1, 800),
            ("Гиря 16", 16, 4000),
            ("Теннисная ракетка", 1, 2500),
            ("Атомная электростанция", 650000, 220000000)
        };

        // Свойства для доступа к элементам
        public static string[] Names => Array.ConvertAll(items, item => item.name);
        public static int[] Weights => Array.ConvertAll(items, item => item.weight);
        public static int[] Values => Array.ConvertAll(items, item => item.value);
    }
}